app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-04-08 16:13:04.975620"], ["id", 1]]
---
  def update
    @article = Article.update(params_article)